{
    "Page_1": "Divya  Dhaipullay  \nData  Scientist  & Machine  Learning    Indianapolis , IN • (812) -543-3634 •  ddhaipul@iu. edu   \nhttps://divyadhaipulle09.github.io/divyadhaipullay.github.io/   \nhttps://www.linkedin.com/in/divya -dhaipulle/   \n \nAvailable  to work  immediately • Open  to relocation  within  the US. \n \n• Enthusiastic Data Scientist with a strong aptitude for tackling advanced computer vision challenges in object \ndetection, classification, and segmentation. Demonstrated proficiency in deploying image recognition solutions in \nreal-time environments, backed by two years of focused research . \n• Pioneering efforts in Large Language Models (LLMs) to address challenges in knowledge representation and \nreduce hallucinations for next -generation conversational AI. Skilled in prompt engineering, fine -tuning, and \nconstructing knowledge graphs through advanced Natural Language Processing (NLP) techniques.  \n• Extensive background in designing and implementing comprehensive machine learning systems for production, \nwith a strong command of both supervised and unsupervised models. Possesses a deep understanding of the \nmathematical principles underpinning ML algorithms, fostering innovation and research capabilities.  \n• Proven expertise in executing thorough data cleaning, manipulation, and advanced analytics to extract critical \ninsights that inform business strategies and guide organizational decision -making. One such innovative model is \nactively deployed on the NCPA  platform. LIVE on the NCPA  website . \n \nTECHNICAL  SKILLS  \nProgramming  Languages:  Python  | Java | C |  MATLAB |  R (Statistics)   \nMachine  Learning  Regression Models (Linear, Logistic, Decision Trees, Random  Forest) | Classification \nModels (K -means Clustering, Logistic Regression, KNN) | XGBoost | Gradient \nBoosting Methods | Ensemble  Models |  Support  Vector  Machine   \nDeep Learning:  Neural  Networks  (Convolutional  Neural  Networks  (CNN),  Deep  NN, Graph  NN, \nRecurrent  \nNN) | Word/Image Embedding Techniques | LSTMs, GRU | Gen AI (Generative \nAdversarial Networks, Transformers, Self -attention models, Vision Transformers).  \nComputer  Vision  Object detection, image classification,  semantic  segmentation (R -CNN Family, Mask  \nR-CNN, YOLO, SSD) | EfficientNet, ResNet, VGG | Vision Transformers . \nNatural language Processing  BERT  Language  Models  | GenAI,  GANs, NLU, Gensim, Topic Modelling, LDA  \nLarge Language Models  OpenAI,  LLAMAv2,  Falcon  180B,  Claude  AI, LangChain , Prompt - Engineering \n(Text, Vision), LangChain, OpenAI, GPT, Dream Booth, OWL -ViT, Comet_ML, \nLoRA, TinySolar.  \n \nML and  DL Tools:  PyTorch  | TensorFlow  | Keras  | HuggingFace  | OpenCV  | NLTK  | Spacy  | Numpy  | \nPandas  | Matplotlib  | Seaborn  | scikit -learn/sklearn  | Scipy  | CUDA  | XGBoost  | Plotly   \nData  Engineering  & cloud:  SQL | PySpark |  Azure  (Databricks,  Data  Factory, Data Lake) | AWS (S3, EC2, \nLambda, Sagemaker).  \nData  Visualization  & other \ntools:  Power  BI | Statistical  Analysis  using  R (ggplot)  | Altair  |Hypothesis  testing  | Microsoft  \nOffice (Advanced  MS Excel)  | JIRA  | CUDA  | Git | GitHub  | GitLab  | Putty   \nWORK  AND  RESEARCH  EXPERIENCE  \n Tata Elxsi , Senior Engineer  Sept 2018  - July 2022  | Bangalore,  \nIndia Enhanced decision -making and operational efficiency for clients like Caterpillar Inc., Jaguar Land Rover, Defense \nResearch Development Organization (DRDO) and National Centre for the Performing Arts (NCPA)  using  data models  \n• Developed and deployed a facial recognition model on AWS using CNN and VGG on AWS, achieving 95%  accuracy.  \n• Reduc ed manual  verification time by 60%  and e nhanced security protocols lead to a 40%  decrease in fraud incidents.  \n• Enhanced system reliability by increasing operational reliability by 10%  and reducing failure rates by 12%  for DRDO . \n• Increased customer engagement by 28%  and ATC (add -to-cart) rate by 12%  by developing personalized recommender \nsystems using XGBoost regressor  with 97%  accuracy on historical sales data  of NCPA . \n• Projected a 25%  increase in customer retention and reduced churn rate by 20%  using customer churn prediction model.  \n• Enhanced region -based customer segmentation using DBSCAN  algorithm  and achiev ed a high cluster similarity of 93%.  ",
    "Page_2": "• Identified  top-ranked  item categories  for each user, thereby  triggering  personalized  recommendations  to different  clusters.  \n• Created a comprehensive supply chain management dashboard for Jaguar Land Rover , reducing overhead by 30%.  \n• Processed large datasets to predict failures, improving system efficiency by 14%,  reducing maintenance costs by 10% . \n• Boosted sales by 32%  by identifying top -performing product categories and implement ed targeted user recommendation s. \n• Designed a n SQL model that matched user preferences with 94%  accuracy, improving personalized shopping experiences . \n• Led PMST activities on Antenna/PIVI, enhancing component management efficiency, reducing delivery time by 20% . \n• Designed and implemented a Power BI dashboard for Caterpillar , consolidating 20 release operations into one interface.  \n• Conducted advanced data analytics in Python and SQL, identifying KPIs that improved operational efficiency by 15% . \n \nPROJECTS   \nSentiment Analysis of Tweets Extracted on Covid -19 Pandemic  Jan 2023  – May 2023  | Bloomington,  Indiana  \n• Modeled Twitter data for sentiment analysis and topic modeling to identify prevailing emotions and key discussion \ntopics in the comment section, leveraging NLTK, Empath, and LDA  \nPySpark and GCP Data Pipeline for NYC Transportation Analysis  Jan 2023  – May 2023  | Bloomington,  Indiana  \n• Developed a comprehensive Big Data analytics pipeline on Google Cloud Platform using PySpark for exploratory \ndata analysis, preprocessing, and predictive modeling  on NYC yellow taxi data  \nCOVID -19 Data Pipeline and ETL Automation  Jan 2024  – May 2024  | Bloomington,  Indiana  \n• Developed an automated ETL pipeline for COVID -19 data integration, transformation, and storage, ensuring accurate \nand up -to-date datasets for analytical purposes.  \nAzure Data Pipeline and Transformation for Tokyo Olympics Data  Aug 2024  – Dec 2024  | Bloomington,  Indiana  \n• Implemented end -to-end data integration and transformation for the Tokyo Olympics dataset using Azure Data \nFactory and Databricks, including pipeline design, data synchronization, and PySpark -based processing.  \n \nEDUCATION  \nIndiana University Bloomington, Masters in Data Science, GPA: 3.69/4  Aug 2022 - May 2024 | Bloomington, IN \nIndiana University, Research Assistant   May 2023 - Present | Bloomington, IN  \n● Generated 4k lane image segmentation datasets using MobileSAM, SAM, Semantic -SAM, FastSAM, and \nMask2Former.  \n● Annotated 1k images in Roboflow for lane segmentation in Vehicle Autonomous Intelligence Lab under Prof. Lantao Liu.  \n● Achieved an MSE of 1.2, R² of 0.82, and correlation coefficients ~1 in MDS coordinate prediction using DenseNet, Beta \n- VAE, ResNet, and Hugging Face Transformers (ViT, BEiT), I -JEPA in the Cognitive Science under Prof. Zoran \nTiganj.  \n● Increased processing efficiency by 30% for whole slide image analysis with optimized GAN and Cycle GAN models on \nBigRed200/Slate HPC systems in the Computational Biology Lab under Prof. Xuhong Zhang.  \nFraunhofer Institute for Industrial Engineering IAO, Research Assistant  June 2023 - Present | Remote  \n● Achieved 80% accuracy in anxiety detection using EEG and RES signals by implementing ML algorithms (SVM, KNN, \nRandom Forest, Naive Bayes, XGBoost) with an opinion pooling technique.  \nUniversity of Texas at Austin, Post -Graduation in Machine Learning, GPA: 4.00/4.33                    2021 - 2023 | Remote  \nVisveswaraya Technological University, Bachelors in Electronics and Communication Engg., GPA: 3.76/4.00      2014 - 2018 | India  \nPage  2|2 "
}